IDENTIFICATION DIVISION.
PROGRAM-ID. 01_READ_FILE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT mef ASSIGN TO '../data/mef.txt'
ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD mef.
01 F_MER.
  02 F_MER-SSN PIC 999999999.
  02 F_MER-YEAR PIC 9999.
  02 F_MER-AMNT PIC z(9)9.99.

WORKING-STORAGE SECTION.
01 MER.
  02 MER-SSN PIC 999999999.
  02 MER-YEAR PIC 9999.
  02 MER-AMNT PIC z(9)9.99.
01 B_EOF PIC A(1) VALUE 'F'.

PROCEDURE DIVISION.

OPEN INPUT PERSON.

PERFORM UNTIL B_EOF = 'T'
  READ PERSON INTO S_PERSON
    AT END MOVE 'T' TO B_EOF
    NOT AT END DISPLAY S_PERSON
  END-READ
END-PERFORM.

CLOSE PERSON.

STOP RUN.
