IDENTIFICATION DIVISION.
PROGRAM-ID. print_mef.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT mef ASSIGN TO '../data/mef.txt'
ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD mef.
01 f_mer.
  02 f_mer-ssn PIC 999999999.
  02 f_mer-year PIC 9999.
  02 f_mer-amnt PIC z(9)9.99.

WORKING-STORAGE SECTION.
01 mer.
  02 mer-ssn PIC 999999999.
  02 mer-year PIC 9999.
  02 mer-amnt PIC z(9)9.99.
01 b_eof PIC A(1) VALUE 'F'.

PROCEDURE DIVISION.

OPEN INPUT mef.

PERFORM UNTIL b_eof = 'T'
  READ mef INTO mer
    AT END MOVE 'T' TO b_eof
    NOT AT END DISPLAY mer
  END-READ
END-PERFORM.

CLOSE mef.

STOP RUN.
