IDENTIFICATION DIVISION.
PROGRAM-ID. conv_wage.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT INF ASSIGN TO './data/wage-index.txt'
    ORGANIZATION IS LINE SEQUENTIAL.
  SELECT OUTF ASSIGN TO './data/wage-index.dat'
    ORGANIZATION IS INDEXED
    ACCESS IS DYNAMIC
    RECORD KEY IS OSTR-YR.

DATA DIVISION.
FILE SECTION.
FD INF.
  01 ISTR.
    02 ISTR-YR PIC 9(4).
    02 filler PIC X VALUE " ".
    02 ISTR-X PIC 9(6).99.

FD OUTF.
  01 OSTR.
    02 OSTR-YR PIC 9(4).
    02 filler PIC X VALUE " ".
    02 OSTR-X PIC 9(6).99.

WORKING-STORAGE SECTION.
  01 B_EOF PIC A VALUE 'F'.

PROCEDURE DIVISION.
OPEN INPUT INF.
OPEN OUTPUT OUTF.
CLOSE OUTF.
OPEN I-O OUTF.

PERFORM UNTIL B_EOF = 'T'
   READ INF INTO OSTR
       AT END MOVE 'T' TO B_EOF
   END-READ
   IF NOT B_EOF = 'T' THEN
       WRITE OSTR
       END-WRITE
   END-IF
END-PERFORM.

CLOSE INF.
CLOSE OUTF.
STOP RUN.
